app/views/topics/_form.html.erb

SELECT `courses`.* FROM `courses`
---
    <%= f.label :course_id, :class => 'control-label' %>
    <%= f.collection_select :course_id, Course.all, :id, :name, {prompt: "Select a course"}, {class: "form-control"} %>