app/views/problems/_form.html.erb

SELECT `topics`.* FROM `topics`
---
    <%= f.label :topic_id, :class => 'control-label' %>
    <%= f.collection_select :topic_id, Topic.all, :id, :name, {prompt: "Select a topic"}, {class: "form-control"} %>