app/controllers/tests_controller.rb

SELECT `tests`.* FROM `tests`
---
  def index
    @tests = Test.all

INSERT INTO `tests` (`course`, `created_at`, `difficulty`, `problems`, `time`, `topics`, `updated_at`) VALUES ('1', '2014-09-28 15:16:08', 1, 3, 45, '\"Databases\" \"Probability and Statistics\"', '2014-09-28 15:16:08')
---
  def create
    @test = Test.new(test_params)

    respond_to do |format|
      if @test.save

UPDATE `tests` SET `course` = 'Databases', `hide_timer` = 1, `updated_at` = '2014-09-28 15:41:11' WHERE `tests`.`id` = 1
---
  def update
    respond_to do |format|
      if @test.update(test_params)

SELECT  `tests`.* FROM `tests`  WHERE `tests`.`id` = 1 LIMIT 1
---
    def set_test
      @test = Test.find(params[:id])