app/views/tests/_form.html.erb

SELECT `courses`.* FROM `courses`
---
          <div class="form-group">
            <%= f.collection_select :course, Course.all, :name, :name, {prompt: "Select a course"}, {class: "form-control"} %>

SELECT `topics`.* FROM `topics`
---
          <div class="form-group">
            <%= f.collection_select :topics, Topic.all, :name, :name, {prompt: "Choose some topics"}, {class: "form-control"} %>