app/views/tests/show.html.erb

SELECT `problems`.* FROM `problems`
---
  <tbody>
    <% Problem.all.each do |problem| %>